feat(day2): Add alternative
